[
  {
    "term": "computer science",
    "definition": "The theory, experimentation, and engineering that form the basis for the design and use of computers. It involves the study of algorithms that process, store, and communicate digital information. A computer scientist specializes in the theory of computation and the design of",
    "context": []
  },
  {
    "term": "node",
    "definition": "Is a basic unit of a data structure, such as a linked list or tree data structure. Nodes contain data and also may link to other nodes. Links between nodes are often implemented by pointers.",
    "context": [
      "Tree nodes \ncontain words and their part of speech (POS) tags.",
      "| HL – HR | <= 1                                    (1) \n \nNode insertion and deletion operations can have O(N) \nworst-case efficiency, where N is the number of tree nodes ."
    ]
  },
  {
    "term": "list",
    "definition": "An abstract data type that represents a countable number of ordered values, where the same value may occur more than once. An instance of a list is a computer representation of the mathematical concept of a finite sequence; the (potentially) infinite analog of a list is a stream.[140]: §3.5 Lists are a basic example of containers, as they contain other values. If the same value occurs multiple times, each occurrence is considered a distinct item.",
    "context": [
      "Imposing that limitation \nmakes the search efficiency logarithmic, O (log zn), in comparison to the linear lists, which have linear search  \nefficiency O(n).",
      "The input to the \nCroatian Morphological Lexicon is a limited number of \nwords and the output is a list of these words with their POS \ntags."
    ]
  },
  {
    "term": "computing",
    "definition": "Is any goal-oriented activity requiring, benefiting from, or creating computing machinery. It includes study of algorithmic processes and development of both hardware and software. It has scientific, engineering, mathematical, technological and social aspects. Major computing fields include computer engineering, computer science, cybersecurity, data science, information systems, information technology and software engineering.[73]",
    "context": [
      "[3] A-C. N. Ngomo, \"Knowledge-free discovery of dom ain-\nspecific multiword units\", in Proceedings of the z0 08 ACM \nsymposium on Applied computing, pages 1561-1565, \nFortaleza, Ceara, Brazil, z008."
    ]
  },
  {
    "term": "state",
    "definition": "In information technology and computer science, a system is described as stateful if it is designed to remember preceding events or user interactions;[219] the remembered information is called the state of the system.",
    "context": [
      "The state of t he \nart shows that there is interest in statistical [1, z] , \nunsupervised machine learning [3, 4], and syntactic \napproaches [5] to the problem."
    ]
  },
  {
    "term": "set",
    "definition": "Is an abstract data type that can store unique values, without any particular order. It is a computer implementation of the mathematical concept of a finite set. Unlike most other collection types, rather than retrieving a specific element from a set, one typically tests a value for membership in a set.",
    "context": [
      "This is a part of the AVL dictionary word list with its \nPOS tags:  \nInverzno -A \nKod -N \nLoša -A \nPC -N \nPrednosti -N \nSetTimer -N \nTakav -P \nTakođer -C \nTo -P \nVrlo -A \nWindowsi -N \nakvizicijska -A \nali -C \nautomatizirane -A \nbi -V \nbiti -V \nbroj -N \ndebugati -V \ndobije -V \ndobiti -V \ndobiveni –A \ndodatno -A \ndotičnim -A \ndovoljno -A \n \nThe syntactic patterns for English proposed by different \nauthors are shown in the following list [6]: \n \n1."
    ]
  },
  {
    "term": "tree",
    "definition": "A widely used abstract data type (ADT) that simulates a hierarchical tree structure, with a root value and subtrees of children with a parent node, represented as a set of linked nodes.",
    "context": [
      "Automatic Building of a Dictionary of Technical Ter ms and Collocations \n Based on AVL Tree  \n \nDavor Blažeković, Maja Matetić and Marija Brkić  \nDepartment of Informatics \nUniversity of Rijeka \nOmladinska 14, 51000 Rijeka, Croatia   \nPhone: (+385) 91 503 13z7 E-mail: davor.blazekovic@ri.t-com.hr , majam@inf.uniri.hr , mbrkic@inf.uniri.hr  \n \n \n \nAbstract - The aim of this work is automatic buildi ng of a \ndictionary of technical collocations.",
      "The dictionary is implemented as  an AVL \ntree, a binary tree which ensures performance of op erations \nsuch as insertion and retrieval in logarithmic time ."
    ]
  },
  {
    "term": "domain",
    "definition": "Is the targeted subject area of a computer program. It is a term used in software engineering. Formally it represents the target subject of a specific programming project, whether narrowly or",
    "context": [
      "The input to the building \nprocedure is a number of Croatian technical texts f rom a \nrestricted domain.",
      "Technical \nterms dictionary building for different constrained domains \nis a complex procedure that requires expert engagement \nand close collaboration with linguists."
    ]
  },
  {
    "term": "expression",
    "definition": "In a programming language, a combination of one or more constants, variables, operators, and functions that the programming language interprets (according to its particular rules of precedence and of association) and computes to produce (\"to return\", in a stateful environment) another value. This process, as for mathematical expressions, is called evaluation. F",
    "context": [
      "In our approach we use the \nsyntactic preprocessing of texts in order to better identi fy \ncandidate expressions.",
      "REFERENCES \n \n[1] P. Pecina, \"A Machine Learning Approach to Mult iword \nExpression Extraction\", In Proceedings of the LREC z008 \nWorkshop Towards a Shared Task for Multiword Expres sions \n(MWE z008), Marrakech, Morocco, May z008."
    ]
  },
  {
    "term": "algorithm",
    "definition": "An unambiguous specification of how to solve a class of problems. Algorithms can perform calculation, data processing, and automated reasoning tasks. They are ubiquitous in computing technologies.",
    "context": [
      "[4] A-C. N. Ngomo, SIGNUM: A Graph Algorithm for \nTerminology Extraction, Computational Linguistics a nd \nIntelligent Text Processing , Lecture Notes in Computer \nScience, pages 85-95, z008."
    ]
  },
  {
    "term": "procedure",
    "definition": "In computer programming, a subroutine is a sequence of program instructions that performs a specific task, packaged as a unit. This unit can then be used in programs wherever that particular task should be performed. Subroutines may be defined within programs, or separately in libraries that can be used by many programs. In different programming languages, a subroutine may be called a routine, subprogram, function, method, or procedure. Technically, these terms all have different definitions. The generic, umbrella term callable unit is sometimes",
    "context": [
      "The input to the building \nprocedure is a number of Croatian technical texts f rom a \nrestricted domain.",
      "Technical \nterms dictionary building for different constrained domains \nis a complex procedure that requires expert engagement \nand close collaboration with linguists."
    ]
  },
  {
    "term": "syntax",
    "definition": "The syntax of a computer language is the set of rules that defines the combinations of symbols that are considered to be correctly structured statements or expressions in that language. This applies both to programming languages, where the document represents source code, and to markup languages, where the document represents data.",
    "context": [
      "If the document specific dictionary is \navailable apriori, the generation of a target language \ndocument from a source language document essentially \nreduces to syntax planning and morphology processing for \nthe pair of languages involved."
    ]
  },
  {
    "term": "bit",
    "definition": "A basic unit of information used in computing and digital communications; a portmanteau of binary digit. A binary digit can have one of two possible values, and may be physically represented with a two-state device. These state values are most commonly represented as",
    "context": [
      "Here is an example showing a part of the \ndescribed procedure results: \n \nKod -0                                Kod -N \nLoša -0                               Loša -A \nPrednosti -0  Prednosti -N \nTakav -0     Takav -P \nTakođer -C  Također -C \nTo -0   To -P \nVrlo -0   Vrlo -A \nakvizicijska -0  akvizicijska -A \nali -0   ali -C \nautomatizirane -0  automatizirane -A \nbi -0   bi -V \nbiti -V   biti -V \nbroj -N   broj -N \ndobije -0   dobije -V \ndobiti -0   dobiti -V \ndobiveni -A  dobiveni -A \ndodatno -0   dodatno -A \n \nPokreni (Start) – button which activates technical terms \nand collocations search.",
      "This is a part of the AVL dictionary word list with its \nPOS tags:  \nInverzno -A \nKod -N \nLoša -A \nPC -N \nPrednosti -N \nSetTimer -N \nTakav -P \nTakođer -C \nTo -P \nVrlo -A \nWindowsi -N \nakvizicijska -A \nali -C \nautomatizirane -A \nbi -V \nbiti -V \nbroj -N \ndebugati -V \ndobije -V \ndobiti -V \ndobiveni –A \ndodatno -A \ndotičnim -A \ndovoljno -A \n \nThe syntactic patterns for English proposed by different \nauthors are shown in the following list [6]: \n \n1."
    ]
  },
  {
    "term": "computation",
    "definition": "Any type of calculation[53][54] that includes both arithmetical and non-arithmetical steps and follows a well-defined model, e.g. an algorithm. The study of computation is paramount to the discipline of computer science.",
    "context": [
      "[4] A-C. N. Ngomo, SIGNUM: A Graph Algorithm for \nTerminology Extraction, Computational Linguistics a nd \nIntelligent Text Processing , Lecture Notes in Computer \nScience, pages 85-95, z008."
    ]
  },
  {
    "term": "computer",
    "definition": "A device that can be instructed to carry out sequences of arithmetic or logical operations automatically via computer programming. Modern computers have the ability to follow generalized sets of operations, called programs. These programs enable computers to perform an extremely wide range of tasks.",
    "context": [
      "[4] A-C. N. Ngomo, SIGNUM: A Graph Algorithm for \nTerminology Extraction, Computational Linguistics a nd \nIntelligent Text Processing , Lecture Notes in Computer \nScience, pages 85-95, z008."
    ]
  },
  {
    "term": "binary tree",
    "definition": "A tree data structure in which each node has at most two children, which are referred to as the left child and the right child. A recursive definition using just set theory notions is that a (non- empty) binary tree is a tuple (L, S, R), where L and R are binary trees or the empty set and S is a singleton set.[29] Some authors allow the binary tree to be the empty set as well.[30]",
    "context": [
      "The dictionary is implemented as  an AVL \ntree, a binary tree which ensures performance of op erations \nsuch as insertion and retrieval in logarithmic time .",
      "Our dictionary is based on an AVL tree, a balanced \nbinary tree structure named after its authors, G. M. \nAdelson-Velskii and E.M. Landis [7]."
    ]
  },
  {
    "term": "interface",
    "definition": "A shared boundary across which two or more separate components of a computer system exchange information. The exchange can be between software, computer hardware, peripheral devices, humans, and combinations of these.[131] Some computer hardware devices, such as a touchscreen, can both send and receive data through the interface, while others such as a mouse or microphone may only provide an interface to send data to a given system.[132]",
    "context": [
      "User interface with application controls can be see n in \nFig.",
      "Fig 4: Application interface."
    ]
  },
  {
    "term": "server",
    "definition": "A computer that provides information to other computers called \"clients\" on a computer network.[200] This architecture is called the client–server model.",
    "context": [
      "[8] M. Tadić, “Croatian lemmatization server,” in P roc."
    ]
  },
  {
    "term": "sequence",
    "definition": "In mathematics, a sequence is an enumerated collection of objects in which repetitions are allowed and order does matter. Like a set, it contains members (also called elements, or terms). The number of elements (possibly infinite) is called the length of the sequence. Unlike a set, the same elements can appear multiple times at different positions in a sequence, and order does matter. Formally, a sequence can be defined as a function whose domain is either the set of the natural numbers (for infinite sequences) or the set of the first n natural numbers (for a sequence of finite length n). The position of an element in a sequence is its rank or index; it is the natural number for which the element is the image. The first element has index 0 or 1, depending on the context or a specific convention. When a symbol is used to denote a sequence, the nth element of the sequence is denoted by this symbol with n as subscript; for example, the nth element of the Fibonacci sequence F is generally denoted F . For example, (M, A, R, Y) is a sequence of letters with the letter 'M' first and 'Y' last. This sequence differs from (A, R, M, Y). Also, the sequence (1, 1, 2, 3, 5, 8), which contains the number 1 at two different positions, is a valid sequence. Sequences can be finite, as in these examples, or infinite, such as the sequence of all even positive integers (2, 4, 6, ...). In computing and computer science, finite sequences are sometimes called strings, words or lists, the different names commonly corresponding to different ways to represent them in computer memory; infinite sequences are called streams. The empty sequence ( ) is included in most notions of sequence, but may be excluded depending on the context.",
    "context": [
      "Problem arises as a consequence of Croatian language \ncomplexity and specificity regarding language inflexions \nand free word order [9, 10, 11, 1z, 13]."
    ]
  },
  {
    "term": "user",
    "definition": "Is a person who utilizes a computer or network service. Users of computer systems and software products generally lack the technical expertise required to fully understand how they work.[242] Power users use advanced features of programs, though they are not necessarily capable of computer programming and system administration.",
    "context": [
      "The user has r equest ed enhanc ement of the do wnlo aded file.",
      "User interface with application controls can be see n in \nFig."
    ]
  },
  {
    "term": "data structure",
    "definition": "A data organization, management, and storage format that enables efficient access and modification.[94][95][96] More precisely, a data structure is a collection of data values, the relationships among them, and the functions or operations that can be applied to the data.[97]",
    "context": [
      "AVL tree data structure is cre ated \nby mathematicians Adelson-Velskii and Landis [7].",
      "A. Forouzan: Data Structures: A \nPseudocode Approach With C,  Course Technology Press, \n1998."
    ]
  },
  {
    "term": "computational linguistics",
    "definition": "An interdisciplinary field concerned with the statistical or rule-based modeling of natural language from a computational perspective, as well as the study of appropriate computational approaches to linguistic questions.",
    "context": [
      "[4] A-C. N. Ngomo, SIGNUM: A Graph Algorithm for \nTerminology Extraction, Computational Linguistics a nd \nIntelligent Text Processing , Lecture Notes in Computer \nScience, pages 85-95, z008."
    ]
  },
  {
    "term": "linear search",
    "definition": "A method for finding an element within a list. It sequentially checks each element of the list until",
    "context": [
      "Imposing that limitation \nmakes the search efficiency logarithmic, O (log zn), in comparison to the linear lists, which have linear search  \nefficiency O(n)."
    ]
  },
  {
    "term": "method",
    "definition": "In object-oriented programming (OOP), a procedure associated with a message and an object. An object consists of data and behavior. The data and behavior comprise an interface, which specifies how the object may be utilized by any of various consumers[149] of the object.",
    "context": [
      "There are only few \napplications and methods developed for machine \nprocessing of Croatian language texts.",
      "V. APPLICATION DESCRIPTION \n \nThe tool being developed for text processing \nincorporates a fusion of linguistic knowledge and corpora \nmethods."
    ]
  },
  {
    "term": "reference",
    "definition": "Is a value that enables a program to indirectly access a particular datum, such as a variable's value or a record, in the computer's memory or in some other storage device. The reference is said to refer to the datum, and accessing the datum is called dereferencing the reference.",
    "context": [
      "REFERENCES \n \n[1] P. Pecina, \"A Machine Learning Approach to Mult iword \nExpression Extraction\", In Proceedings of the LREC z008 \nWorkshop Towards a Shared Task for Multiword Expres sions \n(MWE z008), Marrakech, Morocco, May z008."
    ]
  }
]